#define  _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<string.h>
//浮点型在内存中的存储
// 常见的浮点数：3.14159  1E10（科学计数法：1.0*10的10次方）
//浮点数家族包括float， double， long double类型
//浮点数表示的范围：float.h中定义

//任意一个浮点数v可以写成：(-1)^s  *M  *2^E,二进制的小数部分可以采用“乘二取整法”
//(-1)^s：表示符号位
//M表示有效数字，一般>=1，小于2，存储时省去个位的1，节约一个数字空间
//*2^E:表示指数位(E时unsigned int类型，存储时需加上127，因为有负数情况出现）
//例如：9.0   二进制形式1001.0
//写作(-1)^0 *1.001*2^3
//    (-1)^s *M    *2^E    -> s=0  M=1.001 E=3

//E值的取出分三种情况，1.E不全为0和1  2.E全为0  3.E全为1
//1.E-127 M+1   2.E-127 M+0    3.m=0 e直接补零

//int main()
//{
//	double d = 1E10;
//	printf("%lf\n", d);
//	return 0;
//}

//int main()
//{
//	int n = 9;
//	float* p = (float*)&n;
//	printf("n=%d\n", n);//9
//	printf("*p=%f\n", *p);//0.000000
//	*p = 9.0;
//	printf("n=%d\n", n);//
//	printf("*p=%f\n", *p);//9.0
//	return 0;
//}

//9的存储
//二进制补码0 00000000 00000000000001001；（补码）
//强制转Float：(-1)^0*0.0000000000000101*2^-126
//9.0的存储
//(-1)^0 *1.001*2^3
//0 10000010(130) 00100000000000000000

//int main()
//{
//	float f = 5.5;//101.1 s=0 m=1.011 e=2   存储：0 10000001（2+127）011 000000000000000000 -> 40 b0 00 00
//	return 0;
//}