#define  _CRT_SECURE_NO_WARNINGS 1
#include<string.h>
#include<stdio.h>
//求一个整数储存在内存中的二进制中1的个数
//注：内存中储存的是整数的补码

int main()
{
	int a = 0;
	int count = 0;
	scanf("%d", &a);
	//while (a)
	//{
	//	if (a % 2 == 1)
	//		count++;
	//	a = a / 2;//比如10进制下的123，先除以10，商12，余3；再除以10，商1，余2；再除以10，余1.所以余数即为各数位上的数
	//}
	//上述方法存在缺点：正整数原码，补码，反码相同，而负数的不一样

	//利用按位与特性解题
	//00000000000000000000000000000011
	//00000000000000000000000000000001
	//00000000000000000000000000000001
	int i = 0;
	for (i = 0;i < 32;i++)
	{
		if (1 ==(( a >> i) & 1))
			count++;
	}
	printf("1的个数为%d", count);
	return 0;
}

//上述方法存在缺点：正整数原码，补码，反码相同，而负数的不一样